def calc_index(weight_calc, height_calc):
    if height_calc > 3:
        height_calc /= 100
    imt = weight_calc / (height_calc ** 2)
    return imt


def interpreter(bmi_inter):
    if bmi_inter < 18.5:
        print("Недостаточная масса тела")
    elif 18.5 <= bmi_inter < 25:
        print("Норма (оптимальный показатель, при котором минимальны риски развития сопутствующих заболеваний)")
    elif 25 <= bmi_inter < 30:
        print("Избыточная масса тела (предожирение)")
    else:
        print("Меньше бургеров")


def recommend(bmi_rec):
    print(f"В связи с вашим индексом тела {round(bmi_rec, 2)}, соблюдайте следующие рекомендации")
    if bmi_rec < 18.5:
        print("Сосредоточьтесь на питательной и калорийной пище. Сбалансированный рацион с достаточным количеством "
              "белков и полезных жиров поможет восстановить здоровье. Рекомендация: Проконсультируйтесь с "
              "врачом-терапевтом, чтобы исключить эндокринные или нутриентные дефициты.")
    elif 18.5 <= bmi_rec < 25:
        print("Поддерживайте текущий образ жизни. Рекомендация: Убедитесь, что ваш рацион разнообразен, а физическая "
              "активность (например, не менее 150 минут умеренных нагрузок в неделю) присутствует регулярно")
    elif 25 <= bmi_rec < 30:
        print("Направьте усилия на постепенное снижение калорийности питания (на 300–500 ккал в день). Рекомендация: "
              "Отдайте предпочтение цельным продуктам и увеличьте ежедневную активность")
    else:
        print("Самостоятельные жесткие диеты могут навредить здоровью. Рекомендация: Обратитесь за помощью к "
              "врачу-эндокринологу или диетологу для составления безопасного плана лечения и "
              "исключения метаболического синдрома.")


weight = int(input("Введите свой вес (в кг)"))
height = float(input("Введите свой рост (см/метры)"))

bmi = calc_index(weight, height)
print(round(bmi, 2))
interpreter(bmi)
recommend(bmi)
